app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 10)
---
SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)